{"unk_token": "<unk>", "bos_token": "<s>", "eos_token": "</s>", "add_prefix_space": false, "errors": "replace", "sep_token": "</s>", "cls_token": "<s>", "pad_token": "<pad>", "mask_token": "<mask>", "trim_offsets": true, "added_tokens_decoder": {"0": {"content": "<s>", "lstrip": false, "normalized": true, "rstrip": false, "single_word": false, "special": true}, "1": {"content": "<pad>", "lstrip": false, "normalized": true, "rstrip": false, "single_word": false, "special": true}, "2": {"content": "</s>", "lstrip": false, "normalized": true, "rstrip": false, "single_word": false, "special": true}, "3": {"content": "<unk>", "lstrip": false, "normalized": true, "rstrip": false, "single_word": false, "special": true}, "50264": {"content": "<mask>", "lstrip": true, "normalized": true, "rstrip": false, "single_word": false, "special": true}}, "additional_special_tokens": [], "clean_up_tokenization_spaces": true, "model_max_length": 512, "special_tokens_map_file": "/dccstor/aashka1/sentence_embeddings/models/sent_embedd_model/6L_retromae_encoder_kd_2epoch/special_tokens_map.json", "name_or_path": "/dccstor/aashka1/sentence_embeddings/models/sent_embedd_model/distilled_models/51.3_teacher_withIBMTech-06.18.24/RetroMAEKD_joint_stage_KD_stage0v7_stage1v12_IBMTech_HNv2_perturb_positives", "tokenizer_class": "RobertaTokenizer"}